# !/usr/local/bin/python3
# coding=utf-8

# 用input接收屏幕输入，将输入的值用int函数进行转换，转换后的值赋给x
x = int(input('x='))
# 判断x的值是否等于10
if x == 10:
    print("打印一次x：%d" % (x))
    print("再打印一次x：%d" % (x))

# "/"除，例如，9除以2=4.5
print("9.0/2=%d" % (9.0/2))
# “//”取整，例如，9除以2=4
print("9除以2的整数=%d" % (9//2))
# "%"取余，例如97/21，余数是13（4*21+13=97）
print("97除以21的余数=%d" % (97 % 21))

# 比较运算符：大于>， 小于<， 大于等于>=， 等于==， 不等于!=，

# 逻辑运算符 or and not

# 赋值运算符 赋值=， 加赋值+=， 取余赋值%=， 减赋值-=

y = int(input('y='))
y += 10
print("y=%d" % (y))
y %= 10
print("y=%d" % (y))
